package GameStuff.SceneSystem.Scenes;

import GameStuff.SceneSystem.Options.*;

public class GameOver extends Scene{
    public GameOver() {
        super("⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣀⣠⣤⣶⣶⣾⣟⣛⣿⡿⢛⡿⡳⢶⣤⡀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣠⣴⡿⠟⠋⠉⠀⠄⠀⢉⠛⢿⣮⡵⠪⠊⠁⡨⠿⣶⡄⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⢀⣼⡿⢋⠀⠀⠠⠦⠀⠒⠀⠚⠀⠀⠈⠻⣶⣖⠉⠔⢊⡬⢻⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣸⡿⠀⠈⣄⠀⠀⢀⠀⠀⠒⠀⠀⠆⠀⠈⠁⠙⢷⣎⠥⠂⢉⣿⣆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡇⠃⠀⠀⠀⠉⠉⠀⢀⠘⠀⠀⠤⠀⠐⠆⠀⠄⠻⣧⢈⡵⠊⢿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⣁⠀⢸⡿⠛⣦⠀⠀⠀⣶⡆⠀⠀⣴⡾⢷⣄⠀⢀⣹⣧⠐⢁⣼⣿⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⠁⠀⢸⣿⣶⣿⠈⠋⠀⣿⣿⠀⠀⢸⣧⣴⡿⠘⢆⠸⣿⣶⣿⠟⣿⡆⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡀⠂⠈⢿⠈⠙⢷⠀⠀⠹⠏⠈⠁⠈⠯⠀⠀⠀⠈⢁⣿⠏⢀⠔⣿⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡧⠒⡖⠤⡤⠄⣠⠤⠒⠀⠀⠶⠀⠀⠀⠀⢀⣠⢴⣿⣿⠀⡠⠞⢹⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡇⠀⠙⠤⢌⠉⠀⠔⠊⠀⠀⠀⠈⣖⣲⢾⠏⠀⠀⢸⡿⠈⠀⣀⣼⡇⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡇⠄⠀⠀⠀⠱⡀⠀⠠⡇⠀⠀⠉⠉⠀⢸⠀⠈⠳⣿⡇⢀⡾⢁⣿⡇⢠⠞⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⣿⡇⠀⠀⣆⠀⠂⢹⣄⠀⠀⠀⣼⠀⠀⠀⢈⠁⠀⠀⣿⡇⢁⣠⣾⠻⢧⠎⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                "⠀⠀⠀⠀⠀⠀⠀⠀⠙⣦⣀⠀⣿⣷⣇⡰⢿⣇⠀⠀⠫⠑⠦⣼⠹⠀⠀⢠⠟⣇⡀⡼⠁⠙⠇⠟⠃⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                "⠀⠀⠀⠀⠀⠀⠀⠀⠀⠈⠛⠛⠾⠁⠉⠁⠀⠈⠀⠀⠀⠀⠀⠀⠀⠀⠀⠘⠂⠈⠀⠁⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀⠀\n" +
                "Você sucumbiu aos terrores das masmorras do Castelo de Fogo. Os ecos de sua derrota se misturam às sombras eternas do lugar. \nSua jornada termina aqui, mas sua lenda talvez inspire outros aventureiros a tentar o impossível. [FIM DE JOGO]");
        options.add(new Quit());
    }
}
